'use strict';   

/*
  Попросить пользователя ввести произвольную строку
  и записать ее в переменную string
  
  PS: для перебора массива используте цикл for или for...of
*/

let string;
let arr;

// Разбить строку в массив, пусть разделителем будет пробел, и записать в переменную arr
console.log();

// Вывести в консоли общую длину массива arr
console.log();

// Используя цикл, вывести в консоль все индексы массива arr
console.log();

// Используя цикл, вывести в консоль все элементы массива arr
console.log();

// Используя цикл, bывести в консоли все пары индекс:значение массива arr
console.log();